nxp-mcuxpresso/mcux-sdk-examples/evkmimxrt1010/demo_apps/hello_world_swo/pin_mux.h
/*
 * Copyright 2022 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/***********************************************************************************************************************
 * Definitions
 **********************************************************************************************************************/

/*! @brief Direction type  */
typedef enum _pin_mux_direction
{
  kPIN_MUX_DirectionInput = 0U,         /* Input direction */
  kPIN_MUX_DirectionOutput = 1U,        /* Output direction */
  kPIN_MUX_DirectionInputOrOutput = 2U  /* Input or output direction */
} pin_mux_direction_t;

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/* GPIO_AD_09 (number 48), ADC12_4/JTAG_TDO/J55[6]/J26[4] */
/* Routed pin properties */
#define BOARD_ADC12_4_PERIPHERAL                                             ARM   /*!< Peripheral name */
#define BOARD_ADC12_4_SIGNAL                                       arm_trace_swo   /*!< Signal name */

/* GPIO_SD_05 (number 70), USER_BUTTON */
/* Routed pin properties */
#define BOARD_USER_BUTTON_PERIPHERAL                                       GPIO2   /*!< Peripheral name */
#define BOARD_USER_BUTTON_SIGNAL                                         gpio_io   /*!< Signal name */
#define BOARD_USER_BUTTON_CHANNEL                                             5U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_USER_BUTTON_GPIO                                             GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_USER_BUTTON_GPIO_PIN                                            5U   /*!< GPIO pin number */
#define BOARD_USER_BUTTON_GPIO_PIN_MASK                               (1U << 5U)   /*!< GPIO pin mask */
#define BOARD_USER_BUTTON_PORT                                             GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_USER_BUTTON_PIN                                                 5U   /*!< PORT pin number */
#define BOARD_USER_BUTTON_PIN_MASK                                    (1U << 5U)   /*!< PORT pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
